1. Введение

Данный документ описывает функциональность и архитектуру бота для поиска исполнителей задач в Discord, предоставляя подробную документацию к UML диаграмме состояний и коду, который может быть реализован на ее основе.

2. Обзор функциональности

Бот предназначен для автоматизации процесса поиска исполнителей для задач, размещенных пользователями в Discord. Он выступает как посредник между заказчиком и исполнителем, оптимизируя процесс поиска и взаимодействия.

3. Функциональные требования 
1 - Размещение задания:Пользователь может создать задание указав :
    1 - Текст задания(краткое описание и обязательные требования)
    2 - Срок выполнение задания
    3 - Дополнительные параметры (необходимые навыки)
2 - Валидация задания:
    Бот проверяет корректность введённых данных, что бы предотвратить ошибки и неккоректные запросы.
    Пример: Нереалистичное время выполнения
    После проверки если задача валидна процесс идёт дальше в случае ошибки мы возврачаемся в начальное состаяние
    "Ожидание задания"
3 - Поиск исполнителя:
    Бот публикуе задание в специальном канале Discord, где зарегестрированны исполнители 
    и подходящие исполнители по навыкам получают оповещение  в канале с предложеннием 
    данного задания 
4 - Обработка отклика исполнителя:
    1 - Бот обрабатывает отклики по времени
    2 - Бот выдаёт задание первому исполнителю, который откликнулся
    3 - При получение откликов после выдачи задания, бот отправляет сообщение "Задание определенно испалнителю"
    4 - Если в течении 30 минут бот не получает отклики от исполнитель, он переходит в состояние
    "Исполнитель не найден" и отправляет соответствующее сообщение пользователю(заказчику)
    после чего переходит в начальное состояние "Ожидание задачи"
5 - Уведомления: Бот оповещает пользователей о ключевых событиях:
    1 - О начале поиска исполнителя
    2 - Об успешном поиске исполнителя
    3 - О завершении задания
    4 - О не найденом исполнителе
6 - Ведение истории заданий:    
     Бот хранит информацию о всех созданных заданиях,включая статус выполнение, исполнителя, дату завершения
4. Описание состояний:

1 - Ожидание задания (Waiting): Бот находится в пассивном режиме, ожидая получения нового задания.
2 - Обработка задания (Processing): Бот получает задание от пользователя.
3 - Проверка валидности (Validation): Бот анализирует задание на соответствие требованиям.
4 - Поиск исполнителя (Searching): Бот публикует задание в канале Discord.
5 - Ожидание отклика (Awaiting): Бот ожидает отклика исполнителей.
6 - Исполнитель найден (Found): Бот получил сообщение от исполнителя.
7 - Исполнитель не найден (NotFound): Время поиска исполнителя истекло.
8 - Задание завершено (Completed): Бот получил уведомление о завершении задания.
9 - Ошибка (Error): Бот обнаруживает невалидное задание.
10 - Сообщение пользователю(заказчику), что исполнитель не найден(customer): После исхода времени 
поиска исполнителя, Бот уведомляет заказчика, что исполнитель не найден 
5. Описание переходов:
    1 - Из " Ожидание задания " в " Проверку валидности ": 
    При получении задания от пользователя(заказчика)
    2 - Из "Проверки задания " в" Обработку задания ":
    В случаее успешно пройденной валидации 
    3 - Из " Проверки задания " в " Ошибка ":
    В случае не успешно пройденной валидации
    4 - Из "Ошибка" в "Ожидание задания":
    После сообщения пользователю(заказчику) об ошибке
    5 - Из "Обработка задания" в" Поиск исполнителя":
    Фильтрует исполнителей и отправляет соответствующий запрос на сервер  с указанными параметрами
    6 - Из "Поиск исполнителя" в"Исполнитель найден":
    После первого отклика, бот сообщает что исполнитель найден
    7 - Из "Поиск исполнителя" в "Исполнитель не найден":
    После истечения времени поиска, в случае если бот не получил отклик, и сообщает об этом на сервер и пользователю(заказчику)
    8 - Из "Исполнитель найден " в"Задание завершено":
    После того как исполнитель принял и завершил задание переходит к состоянию и сообщает пользователю и на сервер об успешном завершении
    9 - Из "Задание завершено " в"Ожидание задания":
    После перехода в "Задание завершено" и отправки информации
    бот переходит в пассивное состояние и ожидает новое задание
    10 - Из "Исполнитель не найден" в"Сообщение заказчику":
    Отправляет пользователю(заказчику) ошибку поиска исполнителя и сообщает что он не найден
    11 - Из "Сообщение заказчику" в"Ожидание задания":
    после неуспешного поиска исполнителя и отправки информации пользователю(заказчику) переходит в пассивное состояние и ожидает новое задание
    

